app/controllers/songs_controller.rb

  def upload
    CSV.foreach(params[:file].path, headers: true) do |song|
      artist = Artist.find_or_create_by(:name => song[1])
      artist.songs.find_or_create_by(:title => song[0])
---
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2018-10-22 22:20:08.143180"], ["updated_at", "2018-10-22 22:20:08.143180"]]
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 7], ["created_at", "2018-10-22 22:20:08.147454"], ["updated_at", "2018-10-22 22:20:08.147454"]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT 1  [["name", ".38 Special"]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."title" = ? LIMIT 1  [["artist_id", 137], ["title", "Caught Up in You"]]